#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// ВКМ++ 26.07.2025
Процедура МассовоеСозданиеРеализацийУслуг(Период) Экспорт
	
	Запрос = Новый Запрос;  
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Договор
		|ПОМЕСТИТЬ втДоговора
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	НЕ ДоговорыКонтрагентов.ПометкаУдаления
		|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
		|	И ДоговорыКонтрагентов.ВКМ_СрокДействия >= &ОкончаниеПериода
		|	И ДоговорыКонтрагентов.ВКМ_Дата <= &НачалоПериода
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Договор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втДоговора.Договор КАК Договор,
		|	РеализацияТоваровУслуг.Ссылка КАК РеализацияУслуг
		|ПОМЕСТИТЬ втРеализации
		|ИЗ
		|	втДоговора КАК втДоговора
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО втДоговора.Договор.Ссылка = РеализацияТоваровУслуг.Договор.Ссылка
		|ГДЕ
		|	РеализацияТоваровУслуг.Дата >= &НачалоПериода
		|	И РеализацияТоваровУслуг.Дата <= &ОкончаниеПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втДоговора.Договор КАК Договор,
		|	втРеализации.РеализацияУслуг КАК РеализацияУслуг
		|ИЗ
		|	втДоговора КАК втДоговора
		|		ЛЕВОЕ СОЕДИНЕНИЕ втРеализации КАК втРеализации
		|		ПО (втДоговора.Договор = втРеализации.Договор)";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_Абонент);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецМесяца(Период));
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;  
	Выборка = РезультатЗапроса.Выбрать();
		
	Всего = Выборка.Количество();
	Сч = 0;
	Пока Выборка.Следующий() Цикл
		Если Не ЗначениеЗаполнено(Выборка.РеализацияУслуг)Тогда			
 			РеализацияДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			РеализацияДокумент.Организация = Выборка.Договор.Организация;
			РеализацияДокумент.Контрагент = Выборка.Договор.Владелец;
			РеализацияДокумент.Договор = Выборка.Договор.Ссылка;
			РеализацияДокумент.Комментарий = "Документ создан с помощью обработки ""Массовое создание актов""";
		Иначе       
			РеализацияДокумент=Выборка.РеализацияУслуг.ПолучитьОбъект(); 
			РеализацияДокумент.Комментарий = "Документ перепроведен с помощью обработки ""Массовое создание актов""";
		КонецЕсли; 
		// +++ ВКМ Замечание от 02.08.2025 
		РеализацияДокумент.Дата = КонецМесяца(Период); 
		РеализацияДокумент.Ответственный = Пользователи.ТекущийПользователь();
		РеализацияДокумент.ВыполнитьАвтозаполнение ();
		Если РеализацияДокумент.Услуги.Количество() <> 0 Тогда
			РеализацияДокумент.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли; 
		Сч = Сч + 1;
		ДлительныеОперации.СообщитьПрогресс(Сч/Всего * 100);    
		// +++ ВКМ Замечание от 02.08.2025 
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецЕсли